[
  {
    "id": "1",
    "title": "The Final Empire",
    "authors": "Brandon Sanderson",
    "tags": "fantasy, high-fantasy, mistborn",
    "description": "Where ash falls from the sky, and mist dominates the night, evil cloaks the land and stifles all life. Criminal mastermind Kelsier teaches Allomancy, the magic of metals, to another Mistborn, urchin Vin 16. The unlikely heroine is distracted by rich Venture heir Elend. Can Kelsier's thieving crew take on the tyrant Lord Ruler and bring back colour to their world?"
  },
  {
    "id": "2",
    "title": "Leviathan Wakes",
    "authors": "James S.A. Corey",
    "tags": "fantasy, high-fantasy, the-expanse",
    "description": "Humanity has colonized the solar system - Mars, the Moon, the Asteroid Belt and beyond - but the stars are still out of our reach. Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, the Scopuli, they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for - and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to the Scopuli and rebel sympathizer Holden, he realizes that this girl may be the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations - and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe."
  },
  {
    "id": "3",
    "title": "The Idea Factory: Bell Labs and the Great Age of American Innovation",
    "authors": "Jon Gertner",
    "tags": "biography, historical, technology, innovation",
    "description": "The definitive history of America s greatest incubator of innovation, the birthplace of some of the 20th century s most influential technologies, including the integrated circuit, the communications satellite and the cell phone. From its beginnings in the 1920s until its demise in the 1980s, Bell Labs officially, the research and development wing of AT&T was the biggest, and arguably the best, laboratory for new ideas in the world."
  },
  {
    "id": "4",
    "title": "Cosmos",
    "authors": "Carl Sagan",
    "tags": "space, science",
    "description": "Cosmos has 13 heavily illustrated chapters, corresponding to the 13 episodes of the Cosmos television series. In the book, Sagan explores 15 billion years of cosmic evolution and the development of science and civilization. Cosmos traces the origins of knowledge and the scientific method, mixing science and philosophy, and speculates to the future of science. The book also discusses the underlying premises of science by providing biographical anecdotes about many prominent scientists throughout history, placing their contributions into the broader context of the development of modern science. The book covers a broad range of topics, comprising Sagan's reflections on anthropological, cosmological, biological, historical, and astronomical matters from antiquity to contemporary times. Sagan reiterates his position on extraterrestrial life—that the magnitude of the universe permits the existence of thousands of alien civilizations, but no credible evidence exists to demonstrate that such life has ever visited earth."
  },
  {
    "id": "5",
    "title": "Hatching Twitter: A True Story of Money, Power, Friendship, and Betrayal",
    "authors": "Nick Bilton",
    "tags": "technology, biography, historical, business, start-up, entrepreneurship",
    "description": "Twitter seems like a perfect start-up success story. In barely six years, a small group of young, ambitious programmers in Silicon Valley built an $11.5 billion business out of the ashes of a failed podcasting company. Today Twitter boasts more than 200 million active users and has affected business, politics, media, and other fields in innumerable ways. Now Nick Bilton of the New York Times takes readers behind the scenes with a narrative that shows what happened inside Twitter as it grew at exponential speeds. This is a tale of betrayed friendships and high-stakes power struggles as the four founders—Biz Stone, Evan Williams, Jack Dorsey, and Noah Glass—went from everyday engineers to wealthy celebrities, featured on magazine covers, Oprah, The Daily Show, and Time’s list of the world’s most influential people. Bilton’s exclusive access and exhaustive investigative reporting—drawing on hundreds of sources, documents, and internal e-mails—have enabled him to write an intimate portrait of fame, influence, and power. He also captures the zeitgeist and global influence of Twitter, which has been used to help overthrow governments in the Middle East and disrupt the very fabric of the way people communicate."
  },
  {
    "id": "6",
    "title": "Red Sister",
    "authors": "Mark Lawrence",
    "tags": "fantasy",
    "description": "I was born for killing – the gods made me to ruin. At the Convent of Sweet Mercy young girls are raised to be killers. In a few the old bloods show, gifting talents rarely seen since the tribes beached their ships on Abeth. Sweet Mercy hones its novices’ skills to deadly effect: it takes ten years to educate a Red Sister in the ways of blade and fist. But even the mistresses of sword and shadow don’t truly understand what they have purchased when Nona Grey is brought to their halls as a bloodstained child of eight, falsely accused of murder: guilty of worse. Stolen from the shadow of the noose, Nona is sought by powerful enemies, and for good reason. Despite the security and isolation of the convent her secret and violent past will find her out. Beneath a dying sun that shines upon a crumbling empire, Nona Grey must come to terms with her demons and learn to become a deadly assassin if she is to survive..."
  },
  {
    "id": "7",
    "title": "The Way of Kings",
    "authors": "Brandon Sanderson",
    "tags": "fantasy, high-fantasy, stormlight-archive",
    "description": "The age before the Heralds abandoned us and the Knights Radiant turned against us. A time when there was still magic in the world and honor in the hearts of men.\n\nThe world became ours, and yet we lost it. Victory proved to be the greatest test of all. Or was that victory illusory? Did our enemies come to recognize that the harder they fought, the fiercer our resistance? Fire and hammer will forge steel into a weapon, but if you abandon your sword, it eventually rusts away."
  },
  {
    "id": "8",
    "title": "A Brief History of Time",
    "authors": "Stephen Hawking",
    "tags": "science, physics",
    "description": "In the ten years since its publication in 1988, Stephen Hawking's classic work has become a landmark volume in scientific writing, with more than nine million copies in forty languages sold worldwide. That edition was on the cutting edge of what was then known about the origins and nature of the universe. But the intervening years have seen extraordinary advances in the technology of observing both the micro- and the macrocosmic worlds. These observations have confirmed many of Professor Hawking's theoretical predictions in the first edition of his book, including the recent discoveries of the Cosmic Background Explorer satellite (COBE), which probed back in time to within 300,000 years of the universe's beginning and revealed wrinkles in the fabric of space-time that he had projected. Eager to bring to his original text the new knowledge revealed by these observations, as well as his own recent research, Professor Hawking has prepared a new introduction to the book, written an entirely new chapter on wormholes and time travel, and updated the chapters throughout."
  },
  {
    "id": "9",
    "title": "Nevernight",
    "authors": "Jay Christoff",
    "tags": "fantasy",
    "description": "In a land where three suns almost never set, a fledgling killer joins a school of assassins, seeking vengeance against the powers who destroyed her family. Daughter of an executed traitor, Mia Corvere is barely able to escape her father’s failed rebellion with her life. Alone and friendless, she hides in a city built from the bones of a dead god, hunted by the Senate and her father’s former comrades. But her gift for speaking with the shadows leads her to the door of a retired killer, and a future she never imagined. Now, Mia is apprenticed to the deadliest flock of assassins in the entire Republic—the Red Church. If she bests her fellow students in contests of steel, poison and the subtle arts, she’ll be inducted among the Blades of the Lady of Blessed Murder, and one step closer to the vengeance she desires. But a killer is loose within the Church’s halls, the bloody secrets of Mia’s past return to haunt her, and a plot to bring down the entire congregation is unfolding in the shadows she so loves. Will she even survive to initiation, let alone have her revenge?"
  },
  {
    "id": "10",
    "title": "\"Surely You're Joking, Mr. Feynman!\": Adventures of a Curious Character",
    "authors": "Richard P. Feynman",
    "tags": "science, physics",
    "description": "A New York Times bestseller—the outrageous exploits of one of this century's greatest scientific minds and a legendary American original.\nRichard Feynman, winner of the Nobel Prize in physics, thrived on outrageous adventures. Here he recounts in his inimitable voice his experience trading ideas on atomic physics with Einstein and Bohr and ideas on gambling with Nick the Greek; cracking the uncrackable safes guarding the most deeply held nuclear secrets; accompanying a ballet on his bongo drums; painting a naked female toreador. In short, here is Feynman's life in all its eccentric—a combustible mixture of high intelligence, unlimited curiosity, and raging chutzpah."
  },
  {
    "id": "11",
    "title": "Sins of Empire",
    "authors": "Brian McClellan",
    "tags": "fantasy",
    "description": "An epic new fantasy series from Brian McClellan, set in the world of his wildly popular Powder Mage trilogy. A world on the cusp of a new age... The young nation of Fatrasta is a turbulent place -- a frontier destination for criminals, fortune-hunters, brave settlers, and sorcerers seeking relics of the past. Only the iron will of the lady chancellor and her secret police holds the capital city of Landfall together against the unrest of an oppressed population and the machinations of powerful empires. Sedition is a dangerous word... The insurrection that threatens Landfall must be purged with guile and force, a task which falls on the shoulders of a spy named Michel Bravis, convicted war hero Mad Ben Styke, and Lady Vlora Flint, a mercenary general with a past as turbulent as Landfall's present.The past haunts us all... As loyalties are tested, revealed, and destroyed, a grim specter as old as time has been unearthed in this wild land, and the people of Landfall will soon discover that rebellion is the least of their worries."
  },
  {
    "id": "12",
    "title": "iCon: Steve Jobs, the Greatest Second Act in the History of Business",
    "authors": "Jeffrey S. Young",
    "tags": "business, technology, biography, leadership",
    "description": "iCon takes a look at the most astounding figure in a business era noted for its mavericks, oddballs, and iconoclasts. Drawing on a wide range of sources, Jeffrey Young and William Simon provide new perspectives on the legendary creation of Apple, detail Jobs’s meteoric rise, and the devastating plunge that left him not only out of Apple, but out of the computer-making business entirely. This unflinching and completely unauthorized portrait reveals both sides of Jobs’s role in the remarkable rise of the Pixar animation studio, also re-creates the acrimony between Jobs and Disney’s Michael Eisner, and examines Jobs’s dramatic his rise from the ashes with his recapture of Apple. The authors examine the takeover and Jobs’s reinvention of the company with the popular iMac and his transformation of the industry with the revolutionary iPod. iCon is must reading for anyone who wants to understand how the modern digital age has been formed, shaped, and refined by the most influential figure of the age–a master of three industries: movies, music, and computers. Editorial Reviews With Simon (coauthor, The Art of Intrusion), journalist Young here updates Steve Jobs: The Journey Is the Reward, his biography of the Apple Computer CEO. The authors, who call Jobs the \"rock star of high tech,\" chronicle the remarkable comeback of the technology wunderkind who had been forced out of Apple in 1985. Jobs subsequently started Pixar, which compiled an impressive track record in developing animated films such as Toy Story and Finding Nemo. He eventually returned to Apple in 1997, where he was instrumental in developing the iMac and the iPod. Many biographies of Jobs suffer from his refusal to cooperate, and this one also betrays a hurried incompleteness, as if the authors were fearful that Jobs might achieve something new that they would be unable to include in time for publication"
  },
  {
    "id": "13",
    "title": "What Would Google Do?",
    "authors": "Jeff Jarvis",
    "tags": "business, technology",
    "description": "What Would Google Do? is an indispensable manual for survival and success in today’s internet-driven marketplace. By \"reverse engineering the fastest growing company in the history of the world,\" author Jeff Jarvis, proprietor of Buzzmachine.com, one of the Web's most widely respected media blogs, offers indispensable strategies for solving the toughest new problems facing businesses today. With a new afterword from the author, What Would Google Do? is the business book that every leader or potential leader in every industry must read."
  },
  {
    "id": "14",
    "title": "A Short History of Nearly Everything",
    "authors": "Bill Bryson",
    "tags": "science, historical",
    "description": "In Bryson's biggest book, he confronts his greatest challenge: to understand—and, if possible, answer—the oldest, biggest questions we have posed about the universe and ourselves. Taking as territory everything from the Big Bang to the rise of civilization, Bryson seeks to understand how we got from there being nothing at all to there being us. To that end, he has attached himself to a host of the world’s most advanced (and often obsessed) archaeologists, anthropologists, and mathematicians, travelling to their offices, laboratories, and field camps. He has read (or tried to read) their books, pestered them with questions, apprenticed himself to their powerful minds. A Short History of Nearly Everything is the record of this quest, and it is a sometimes profound, sometimes funny, and always supremely clear and entertaining adventure in the realms of human knowledge, as only Bill Bryson can render it. Science has never been more involving or entertaining."
  },
  {
    "id": "15",
    "title": "Pawn of Prophecy",
    "authors": "David Eddings",
    "tags": "fantasy",
    "description": "A magnificent epic set against a history of seven thousand years of the struggles of Gods and Kings and men - of strange lands and events - of fate and a prophecy that must be fulfilled! THE BELGARIAD Long ago, so the Storyteller claimed, the evil God Torak sought dominion and drove men and Gods to war. But Belgarath the Sorcerer led men to reclaim the Orb that protected men of the West. So long as it lay at Riva, the prophecy went, men would be safe. But that was only a story, and Garion did not believe in magic dooms, even though the dark man without a shadow had haunted him for years. Brought up on a quiet farm by his Aunt Pol, how could he know that the Apostate planned to wake dread Torak, or that he would be led on a quest of unparalleled magic and danger by those he loved - but did not know? For a while his dreams of innocence were safe, untroubled by knowledge of his strange heritage. For a little while... THUS BEGINS BOOK ONE OF THE BELGARIAD'"
  },
  {
    "id": "16",
    "title": "Hackers: Heroes of the Computer Revolution",
    "authors": "Steven Levy",
    "tags": "technology, historical",
    "description": "A mere fifteen years ago, computer nerds were seen as marginal weirdos, outsiders whose world would never resonate with the mainstream. That was before one pioneering work documented the underground computer revolution that was about to change our world forever. With groundbreaking profiles of Bill Gates, Steve Wozniak, MIT's Tech Model Railroad Club, and more, Steven Levy's Hackers brilliantly captured a seminal moment when the risk-takers and explorers were poised to conquer twentieth-century America's last great frontier. And in the Internet age, the hacker ethic-first espoused here-is alive and well."
  },
  {
    "id": "17",
    "title": "The Martian",
    "authors": "Andy Weir",
    "tags": "sci-fi, space",
    "description": "Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. Now, he’s sure he’ll be the first person to die there. After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive—and even if he could get word out, his supplies would be gone long before a rescue could arrive. Chances are, though, he won’t have time to starve to death. The damaged machinery, unforgiving environment, or plain-old “human error” are much more likely to kill him first. But Mark isn’t ready to give up yet. Drawing on his ingenuity, his engineering skills — and a relentless, dogged refusal to quit — he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?"
  },
  {
    "id": "18",
    "title": "Cephrael's Hand",
    "authors": "Melissa McPhail",
    "tags": "fantasy, high-fantasy",
    "description": "“All things are composed of patterns...” And within the pattern of the realm of Alorin, three strands must cross: In Alorin...three hundred years after the genocidal Adept Wars, the realm is dying, and the blessed Adept race dies with it. One man holds the secret to reverting this decline: Bjorn van Gelderan, a dangerous and enigmatic man whose shocking betrayal three centuries past earned him a traitor’s brand. It is the Adept Vestal Raine D’Lacourte’s mission to learn what Bjorn knows in the hope of salvaging his race. But first he’ll have to find him... In the kingdom of Dannym...the young Prince Ean val Lorian faces a tenuous future as the last living heir to the coveted Eagle Throne. When his blood-brother is slain during a failed assassination, Ean embarks on a desperate hunt for the man responsible. Yet his advisors have their own agendas, and his quest for vengeance leads him ever deeper into a sinuous plot masterminded by a mysterious and powerful man, the one they call First Lord... In the Nadori desert...tormented by the missing pieces of his life, a soldier named Trell heads off to uncover the truth of his shadowed past. But when disaster places him in the debt of Wildlings sworn to the First Lord, Trell begins to suspect a deadlier, darker secret motivating them. Librarian's note: See alternate cover edition of ASIN B0046A9VLO here."
  },
  {
    "id": "19",
    "title": "House of Earth and Blood",
    "authors": "Sarah J. Maas",
    "tags": "fantasy, high-fantasy, crescent-city",
    "description": "Bound by blood. Tempted by desire. Unleashed by destiny. Bryce Quinlan had the perfect life—working hard all day and partying all night—until a demon murdered her closest friends, leaving her bereft, wounded, and alone. When the accused is behind bars but the crimes start up again, Bryce finds herself at the heart of the investigation. She’ll do whatever it takes to avenge their deaths. Hunt Athalar is a notorious Fallen angel, now enslaved to the Archangels he once attempted to overthrow. His brutal skills and incredible strength have been set to one purpose—to assassinate his boss’s enemies, no questions asked. But with a demon wreaking havoc in the city, he’s offered an irresistible deal: help Bryce find the murderer, and his freedom will be within reach. As Bryce and Hunt dig deep into Crescent City’s underbelly, they discover a dark power that threatens everything and everyone they hold dear, and they find, in each other, a blazing passion—one that could set them both free, if they’d only let it. With unforgettable characters, sizzling romance, and page-turning suspense, this richly inventive new fantasy series by #1 New York Times bestselling author Sarah J. Maas delves into the heartache of loss, the price of freedom—and the power of love."
  },
  {
    "id": "20",
    "title": "Steelheart",
    "authors": "Brandon Sanderson",
    "tags": "fantasy, high-fantasy, reckoners",
    "description": "Ten years ago, Calamity came. It was a burst in the sky that gave ordinary men and women extraordinary powers. The awed public started calling them Epics. But Epics are no friend of man. With incredible gifts came the desire to rule. And to rule man you must crush his will.\n\nNobody fights the Epics...nobody but the Reckoners. A shadowy group of ordinary humans, they spend their lives studying Epics, finding their weaknesses, and then assassinating them.\n\nAnd David wants in. He wants Steelheart — the Epic who is said to be invincible. The Epic who killed David's father. For years, like the Reckoners, David's been studying, and planning — and he has something they need. Not an object, but an experience.\n\nHe's seen Steelheart bleed. And he wants revenge."
  }
]